---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.Centerline
source: html/9a7b2e55-5810-62ea-76a4-5db9b5f2e5ab.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.Centerline Property

The abbreviation of the Centerline (=) string.

## Syntax (C#)
```csharp
public string Centerline { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null